const RU = {
  common: {
    more: 'Подробнее',
  },
  title: {
    home: 'Главная',
    about: 'Обо мне',
    skills: 'Навыки',
    experience: 'Опыт',
    portfolio: 'Портфолио',
    contact: 'Контакты',
    language: 'Русский',
  },
  month: {
    september: 'сентябрь',
    october: 'октябрь',
    november: 'ноябрь',
    december: 'декабрь',
    january: 'январь',
    february: 'февраль',
    april: 'апрель',
    march: 'март',
    may: 'май',
    june: 'июнь',
    july: 'июль',
    august: 'август',
  },
  home: {
    hi: 'Привет',
    iam: 'Я –',
    occupation: {
      part1: 'фронтенд-',
      part2: 'разработчик',
    },
    subtitle: 'Баннер',
  },
  about: {
    text:
      'Занимаюсь <strong>фронтенд-разработкой</strong>. Создаю красивые и удобные проекты любой сложности. Воплощаю в жизнь UI/UX идеи',
    feature: {
      projects: {
        label: 'Реализовал множество проектов',
        text:
          'В моем послужном списке около {{textValue}} зарубежных и отечественных коммерческих проектов - от лендингов до крупных веб-приложений. Некоторые из них представлены в <0>{{linkText}}</0>',
      },
      experience: {
        label: 'Опыт разработки {{labelValue}}+ лет',
        text:
          'Первый сайт сделал в 13 лет. Прошел путь от верстальщика до тимлида фронтенд-разработки. Работаю в отечественной ИТ компании и сотрудничаю с новозеландской студией. Подробнее на странице <0>{{linkText}}</0>',
      },
      position: {
        label: 'Ведущий разработчик и ментор',
        text:
          'Разрабатываю проекты с нуля, верстаю, пишу бизнес-логику, оптимизирую и поддерживаю код. Планирую и оцениваю задачи, провожу код-ревью и обучаю. Более подробно в <0>{{linkText}}</0>',
      },
      organizing: {
        label: 'Организованный и автономный',
        text:
          'Большинство проектов разработаны мной самостоятельно. Я люблю брать на себя всю клиентскую часть проекта от обсуждения концепции до финальной реализации и поддержки на продакшне',
      },
      programming: {
        label: 'Люблю программировать',
        text:
          'Фронтенд - мое основное хобби. Мне нравится экспериментировать с {{textValue}}. Интересуюсь кроссплатформенной и бекенд-разработкой. Планирую запустить собственный блог',
      },
      growing: {
        label: 'Постоянно развиваюсь',
        text:
          'Регулярно "затачиваю пилу", изучаю документации, статьи, курсы, книги и доклады по разработке. В постоянном поиске новых технологий и инструментов повышения эффективности',
      },
      perfect: {
        label: 'Склонный к перфекционизму',
        text:
          'Высокое качество - мой главный принцип. В каждый проект я вкладываю всего себя. Однако, сила дедлайна и опыт помогают мне сосредоточиться на скорости и конечном результате',
      },
      education: {
        label: 'Два высших образования',
        text:
          'Окончил "Российский технологический университет" и "Всероссийский государственный институт кинематографии" 🙂. Учеба в последнем очень хорошо прокачала мои гибкие навыки',
      },
      sport: {
        label: 'Занимаюсь спортом',
        text:
          'Физические нагрузки особенно актуальны для разработчика. Каждый день я стараюсь посвящать время спорту (калистеника, велосипед, бег, фитнес). Этим летом открыл для себя сапсерфинг',
      },
      travel: {
        label: 'Путешествую',
        text:
          'Посетил более 15 стран. В восторге от Японии и Новой Зеландии. Был в Хоббитоне, покорил вершину Фудзиямы и остался жив после встречи с уральским медведем на Перевале Дятлова 🙂',
      },
      love: {
        label: 'Счастливый муж',
        text:
          '<0>{{linkText}}</0> - мой главный источник вдохновения и лучший друг. Мы вместе уже более {{textValue}} лет. Кстати, когда-то я разработал прогрессивное веб-приложение для предложения ей руки и сердца 🙂',
      },
      coffee: {
        label: 'Кофеман',
        text:
          'Известно, что "программист - это человек, превращающий кофе в код" 🙂. Свой рабочий день я начинаю с кружечки ароматного кофе. Также после поездки в Японию полюбил чай матчу',
      },
    },
    subtitle: 'Аватар и социальные сети',
  },
  skills: {
    text:
      'Разрабатываю приложения, лендинги, многостраничные сайты и админки. Основной стек - <strong>{{value}}</strong>',
    feature: {
      interface: {
        label: 'Создаю надежные и правильно работающие интерфейсы',
        text:
          'Реализую систему всех возможных элементов интерфейса с удобным взаимодействием и продуманной бизнес-логикой. Забочусь о кроссбраузерности, безопасности и обрабатываю возможные ошибки',
      },
      performance: {
        label: 'Пишу современный и производительный код',
        text:
          'Использую стандарты ES6-ES11, {{textValue}} Grid... Оптимизирую тяжелые вычисления. Избегаю лишних операций и утечек памяти. Применяю техники повышения производительности',
      },
      efficient: {
        label: 'Выбираю простой и эффективный способ решения задачи',
        text:
          'Для любой задачи стараюсь найти оптимальное и понятное решение. Понимаю в каких случаях стоит использовать тот или иной метод, паттерн, библиотеку или инструмент',
      },
      markup: {
        label: 'Верстаю семантично, доступно, кроссбраузерно и pixel-perfect',
        text:
          'Верстаю пиксель в пиксель макеты любой сложности. Использую семантичные теги, не болею "диватозом" 🙂. Тестирую во всех браузерах, включая IE. Забочусь о доступности. Верстаю письма',
      },
      patterns: {
        label: 'Имею в арсенале большое количество паттернов и приемов',
        text:
          'Мемоизация, виртуализация, ленивая загрузка, деструктуризация, декоратор, каррирование, делегирование, рекурсия, модуль, фабрика, наблюдатель, прокси, примесь, троттлинг, дебаунс..',
      },
      modules: {
        label: 'Создаю модульную и оптимальную архитектуру проекта',
        text:
          'Избегаю чрезмерной вложенности, следую принципу разделения ответственности, DRY и KISS. Каждый модуль / класс / компонент отвечает за один набор функций. Конфигурирую систему сборки проекта',
      },
      tools: {
        label: 'Использую актуальные фреймворки, библиотеки и инструменты',
        text:
          'Регулярно слежу за обновлениями используемых технологий и в постоянном поиске новых. Помимо <0>{{linkText}}</0> использую большое количество вспомогательных библиотек и инструментов',
      },
      responsive: {
        label: 'Реализую адаптивный интерфейс и анимации',
        text:
          'Применяю подходы desktop / mobile first. Тестирую интерфейс на каждом пикселе от минимальной до максимальной ширины экрана. Создаю производительные {{textValue}} анимации',
      },
      code: {
        label: 'Соблюдаю единый стиль написания чистого кода',
        text:
          'Пишу самодокументируемый код в декларативном стиле. Применяю лучшие практики популярных стайлгайдов. Активно использую {{textValue}}. Читаемый код важнее быстрого',
      },
      test: {
        label: 'Рефакторю, оптимизирую и тестирую',
        text:
          'Проверяю работу проекта в различных браузерах / устройствах. Провожу рефакторинг кода. Замеряю и ускоряю загрузку ресурсов. Минифицирую и оптимизирую файлы / изображения. Пишу тесты',
      },
      tasks: {
        label: 'Планирую, декомпозирую и документирую',
        text:
          'Планирую бэклог, группирую, декомпозирую и оцениваю задачи. Применяю методологии Kanban / Scrum и GTD. Создал личную систему планирования. Использую таск-менеджеры. Пишу документацию',
      },
      mentor: {
        label: 'Провожу код-ревью и занимаюсь обучением',
        text:
          'Занимаюсь менторством, даю обратную связь по пулл-реквестам и делюсь опытом с коллегами. Разработал корпоративную программу стажировки. Есть опыт проведения собеседований',
      },
    },
    subtitle: 'Технологии',
    technologyGroup: {
      logic: 'Логика',
      markup: 'Разметка',
      styles: 'Стили',
      utils: 'Утилиты',
      tools: 'Инструменты',
      other: 'Другое',
    },
    learn: 'Изучаю',
  },
  experience: {
    text:
      'Профессионально занимаюсь фронтенд-разработкой более {{value}} лет. <strong>Ведущий разработчик</strong> и <strong>тимлид</strong>. Работаю удаленно',
    duties: 'Обязанности',
    achievements: 'Достижения',
    current: 'Текущая должность',
    occupation: {
      lead: 'Тимлид фронтенд-разработки',
      senior: 'Ведущий фронтенд-разработчик',
      middle: 'Фронтенд разработчик',
      junior: 'Верстальщик',
      support: 'Инженер технической поддержки',
    },
    job: {
      duty: {
        logicApps: 'Разработка бизнес-логики приложений',
        logicAppsSites: 'Разработка бизнес-логики приложений и сайтов',
        logicModules: 'Разработка бизнес-логики компонентов приложения',
        structureApps: 'Создание архитектуры приложений',
        structureProjects: 'Создание архитектуры проектов',
        responsive: 'Кроссбраузерная и адаптивная верстка',
        rest: 'Работа с REST API',
        restSocket: 'Работа с REST API и WebSocket',
        refactor: 'Рефакторинг и сопровождение кода',
        scratch: 'Разработка проектов с нуля',
        support: 'Поддержка проектов',
        tasks: 'Декомпозиция и оценка задач',
        tasksTeam: 'Планирование, декомпозиция и оценка задач команды',
        manage: 'Управление и развитие команды',
        review: 'Проведение код-ревью и собеседований',
        serviceDesk:
          'Регистрация и обработка обращений в системах Service Desk',
        hardwareFix:
          'Решение проблем программного обеспечения и периферийного оборудования',
        hardwareInstall:
          'Установка и настройка программного обеспечения и периферийного оборудования',
        consult: 'Консультирование сотрудников по техническим вопросам',
      },
      achievement: {
        resultCorporate:
          'Успешно реализовал несколько масштабных проектов для крупных заказчиков',
        resultForeign:
          'Успешно реализовал с нуля большое количество разноплановых зарубежных проектов',
        resultApp:
          'Успешно реализовал множество компонентов и разделов для крупного приложения',
        pathLead: 'Прошел путь от рядового разработчика до тимлида',
        pathFront: 'Вырос от верстальщика до фронтенд-разработчика',
        internship: 'Разработал корпоративную программу стажировки',
        mentor: 'Стал ментором и обучил несколько стажеров',
        mobile:
          'Помимо веб-приложений разрабатываю мобильные приложения на {{value}}',
        design: 'Периодически занимаюсь дизайном и прототипированием',
        interview: 'Провел десятки собеседований',
        technologies:
          'Изучил и применил на практике множество технологий и библиотек',
        technologiesBase: 'Хорошо прокачал {{value}}',
        speed:
          'Поставил личный рекорд скорости завершения полноценного проекта - 1 день',
        independent: 'Достиг высокого уровня автономности и организованности',
        english: 'Прокачал английский, сотрудничая с иностранными заказчиками',
        testimonials:
          'Получил множество лестных отзывов от коллег / заказчиков',
        work: 'Развил навык работы в команде',
        orders: 'Обработал тысячи заявок',
        hardware: 'Приобрел обширный опыт работы с софтом и железом',
        softSkills: 'Прокачал коммуникативные навыки',
      },
      feature: {
        busyFull: 'полная занятость',
        busyPart: 'частичная занятость',
        remote: 'удаленно',
        office: 'офис',
        moscow: 'Москва, Россия',
        auckland: 'Окленд, Новая Зеландия',
      },
    },
    subtitle: 'Этапы',
    next: 'Вперед',
    back: 'Назад',
    refresh: 'Обновить',
    continue: 'Продолжение следует',
    stepper: {
      step1:
        'Работал <strong>инженером технической поддержки</strong> в компании "{{0}}"',
      step2: 'Расширял кругозор в других сферах деятельности 🙂',
      step3:
        'Параллельно с учебой в институте создавал пет-проекты в процессе обучения веб-разработке',
      step4:
        'Прошел интервью. Выполнил тестовые задания и был приглашен на работу <strong>верстальщиком</strong> в компанию "{{0}}"',
      step5: 'Работал <strong>верстальщиком</strong> в компании "{{0}}"',
      step6:
        'В результате успешной работы получил повышение до <strong>фронтенд-разработчика</strong> в компании "{{0}}"',
      step7:
        'Работал <strong>фронтенд-разработчиком</strong> в компании "{{0}}". В свободное время делал коммерческий проект для компании "{{1}}"',
      step8:
        ' В результате успешного завершения проекта был приглашен в компанию "{{0}}" на должность <strong>фронтенд-разработчика</strong>. Принял решение перейти из "{{1}}" в "{{2}}"',
      step9:
        'Работал <strong>фронтенд-разработчиком</strong> в компании "{{0}}"',
      step10:
        'Договорился с "{{0}}" о продолжении сотрудничества по проектам в режиме частичной занятости. Получил несколько офферов на позицию <strong>ведущего фронтенд-разработчика</strong>, выбрал компанию "{{1}}"',
      step11:
        'Работал <strong>ведущим фронтенд-разработчиком</strong> в компании "{{0}}"',
      step12:
        'В результате успешной реализации нескольких проектов и расширения зоны ответственности получил повышение до <strong>тимлида фронтенд-разработки</strong> в компании "{{0}}"',
      step13:
        'Работаю <strong>тимлидом фронтенд-разработки</strong> в компании "{{0}}". Продолжаю сотрудничество по проектам с "{{1}}"',
    },
  },
  portfolio: {
    developed: 'Разработано в',
    filter: {
      all: 'Все',
      app: 'Приложение',
      site: 'Сайт',
      landing: 'Лендинг',
      admin: 'Админка',
    },
    feature: {
      wholeDevelopment:
        'Фронтенд-разработка с нуля, развитие, поддержка проекта',
      scratchGrowthDevelopment: 'Фронтенд-разработка с нуля, поддержка проекта',
      scratchDevelopment: 'Фронтенд-разработка с нуля',
      growthSupportDevelopment: 'Развитие, поддержка проекта',
      markupBusinessLogic: 'Верстка и разработка части бизнес-логики',
      jqueryReact: 'Переписывание кодовой базы с {{0}} на {{1}}',
      leadWork: 'Тимлид команды фронтенд-разработки',
      teamWork: 'Член команды фронтенд-разработки',
      soloWork: 'Самостоятельная фронтенд-разработка',
      responsive: 'адаптивный интерфейс',
      emails: 'верстка писем',
      design: 'прототипирование и дизайн',
      animations: 'Анимации',
      businessLogic: 'Обширная бизнес-логика',
      pwa: 'прогрессивное веб-приложение',
      firstProject: 'Первый коммерческий проект',
      firstScratchProject: 'Первый коммерческий проект, написанный с нуля',
      spa: 'Превратил сайт в одностраничное приложение',
      tryTwo: `Поработал с {{0}}, и {{1}}`,
      tryThree: `Поработал с {{0}}, {{1}} и {{2}}`,
      tryOneGraph: `Поработал с {{0}} и графиками`,
      sellHouse: 'Дом успешно продан',
      formsTables: 'Много форм и таблиц',
      darkTheme: 'Темная тема',
      dynamicFormsRouting: 'Динамические формы, собственный роутинг',
    },
    project: {
      ninjal: {
        text: 'Лендинг новозеландского сервиса найма водителей грузовиков',
      },
      ninja: {
        text: 'Новозеландский сервис найма водителей грузовиков',
      },
      celebration: {
        text:
          'Новогоднее мини-приложение для поздравления сотрудников компании',
      },
      ally: {
        text:
          'Лендинг мобильного приложения для интерактивных фигурок {{textValue}}',
      },
      presentmel: {
        text: 'Лендинг новозеландского сервиса создания профиля соискателя',
      },
      presentmep: {
        text: 'Админка новозеландского сервиса создания профиля соискателя',
      },
      presentme: {
        text: 'Новозеландский сервис создания профиля соискателя',
      },
      dropdrone: {
        text: 'Лендинг новозеландского сельскохозяйственного стартапа',
      },
      hatched: {
        text: 'Лендинг мобильного приложения-трекера для новорожденных малышей',
      },
      uls: {
        title: 'Единый Кабинет Пользователя',
        text: 'Единый кабинет пользователей компании "{{textValue}}"',
      },
      proximal: {
        text: 'Лендинг австралийской кофейни',
      },
      embp: {
        title: 'АРМА ЕМБП',
        text: 'Админка биометрической платформы для банка "ВТБ"',
      },
      tmf: {
        text: 'Сайт новозеландской строительной компании',
      },
      lite: {
        text: 'Лендинг сервиса новозеландского диджитал-агентства',
      },
      melissa: {
        text: 'Лендинг фитнес-блогера',
      },
      foodp: {
        text:
          'Портал новозеландского сервиса заказа дисконтной еды в ресторанах',
      },
      food: {
        text:
          'Лендинг новозеландского сервиса заказа дисконтной еды в ресторанах',
      },
      sds: {
        text:
          'Корпоративный сервис для работы с документооборотом компании "{{textValue}}"',
      },
      strong: {
        text: 'Сайт мобильного фитнес-приложения',
      },
      glyphs2: {
        text: 'Домашний сайт новозеландского диджитал-агентства',
      },
      rogue: {
        text:
          'Новозеландский сервис группового бронирования авиабилетов и отелей',
      },
      trucks: {
        text: 'Новозеландский сервис мониторинга передвижения грузовиков',
      },
      services: {
        text:
          'Лендинг описания услуг новозеландского диджитал-агентства "{{textValue}}"',
      },
      fcdc: {
        text: 'Админка сервиса управления мероприятиями',
      },
      saffron: {
        text: 'Целевая страница для продажи частного дома в Новой Зеландии',
      },
      whip: {
        text: 'Новозеландский сервис техосмотра автомобилей',
      },
      lazyazd: {
        text: 'Админка новозеландского сервиса доставки товаров',
      },
      lazyaz: {
        text: 'Веб-платформа новозеландского сервиса доставки товаров',
      },
      glyphs: {
        text: 'Домашний сайт новозеландского диджитал-агентства',
      },
      msp: {
        title: 'Бизнес-навигатор МСП',
        text:
          'Ресурс для предпринимателей, которые хотят открыть или расширить свой бизнес',
      },
    },
    subtitle: 'Скриншоты',
    screenshot: 'Скриншот',
    mobile: 'мобильного',
    screen: 'экрана проекта',
  },
  contact: {
    text:
      'Нужна моя <strong>помощь</strong> или есть ко мне <strong>предложение</strong>? Пишите на почту <a>{{linkText}}</a> или воспользуйтесь формой',
    marker: 'Сейчас я живу здесь',
    form: {
      name: 'Имя',
      message: 'Сообщение',
      send: 'Отправить',
    },
    success: {
      thank: 'Сообщение отправлено. Спасибо',
      sent: 'Сообщение отправлено',
      callback: 'В ближайшее время я свяжусь с вами',
      ok: 'Хорошо',
    },
  },
  copyright: {
    crafted: 'Разработано',
    me: 'мной',
    with: 'с',
  },
}

export default RU
