const RU = {
  title: {
    home: 'Главная',
    about: 'Обо мне',
    skills: 'Навыки',
    experience: 'Опыт',
    portfolio: 'Портфолио',
    contact: 'Контакты',
    language: 'Русский',
  },
  common: {more: 'Подробнее'},
  greeting: {
    hi: 'Привет!',
    iam: 'Я –',
    occupation: {
      part1: 'фронтенд-',
      part2: 'разработчик',
    },
  },

  about: {
    text:
      'Занимаюсь <strong>фронтенд-разработкой</strong>. Создаю красивые и удобные проекты любой сложности. Воплощаю в жизнь UI/UX идеи',
    features: {
      projects: {
        label: 'Реализовал множество проектов',
        text:
          'В моем послужном списке около {{textValue}} зарубежных и отечественных коммерческих проектов - от лендингов до крупных веб-приложений. Некоторые из них представлены в <0>{{linkText}}</0>',
      },
      experience: {
        label: 'Опыт разработки {{labelValue}}+ лет',
        text:
          'Первый сайт сделал в 13 лет. Прошел путь от верстальщика до тимлида фронтенд-разработки. Работаю в отечественной ИТ компании и сотрудничаю с новозеландской студией. Подробнее на странице <0>{{linkText}}</0>',
      },
      position: {
        label: 'Ведущий разработчик и ментор',
        text:
          'Разрабатываю проекты с нуля, верстаю, пишу бизнес-логику, оптимизирую и поддерживаю код. Планирую и оцениваю задачи, провожу код-ревью и обучаю. Более подробно в <0>{{linkText}}</0>',
      },
      organizing: {
        label: 'Организованный и автономный',
        text:
          'Большинство проектов разработаны мной самостоятельно. Я люблю брать на себя всю клиентскую часть проекта от обсуждения концепции до финальной реализации и поддержки на продакшне',
      },
      programming: {
        label: 'Люблю программировать',
        text:
          'Фронтенд - мое основное хобби. Мне нравится экспериментировать с {{textValue}}. Интересуюсь кроссплатформенной и бекенд-разработкой. Планирую запустить собственный блог',
      },
      growing: {
        label: 'Постоянно развиваюсь',
        text:
          'Регулярно "затачиваю пилу", изучаю документации, статьи, курсы, книги и доклады по разработке. В постоянном поиске новых технологий и инструментов повышения эффективности',
      },
      perfect: {
        label: 'Склонный к перфекционизму',
        text:
          'Высокое качество - мой главный принцип. В каждый проект я вкладываю всего себя. Однако, сила дедлайна и опыт помогают мне сосредоточиться на скорости и конечном результате',
      },
      education: {
        label: 'Два высших образования',
        text:
          'Окончил "Российский технологический университет" и "Всероссийский государственный институт кинематографии" ☺. Учеба в последнем очень хорошо прокачала мои гибкие навыки',
      },
      sport: {
        label: 'Занимаюсь спортом',
        text:
          'Физические нагрузки особенно актуальны для разработчика. Каждый день я стараюсь посвящать время спорту (калистеника, велосипед, бег, фитнес). Этим летом открыл для себя сапсерфинг',
      },
      travel: {
        label: 'Путешествую',
        text:
          'Посетил более 15 стран. В восторге от Японии и Новой Зеландии. Был в Хоббитоне, покорил вершину Фудзиямы и остался жив после встречи с уральским медведем на Перевале Дятлова ☺',
      },
      love: {
        label: 'Счастливый муж',
        text:
          '<0>{{linkText}}</0> - мой главный источник вдохновения и лучший друг. Мы вместе уже более {{textValue}} лет. Кстати, когда-то я разработал мобильное веб-приложение для предложения ей руки и сердца ☺',
      },
      coffee: {
        label: 'Кофеман',
        text:
          'Известно, что "программист - это человек, превращающий кофе в код" ☺. Свой рабочий день я начинаю с кружечки ароматного кофе. Также после поездки в Японию полюбил чай матчу',
      },
    },
  },
  copyright: {
    crafted: 'Разработано',
    me: 'мной',
    with: 'с',
  },
  hidden: {
    banner: 'Баннер',
    social: 'Аватар и социальные сети',
  },
}

export default RU
